<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Supported Locales
    |--------------------------------------------------------------------------
    | مصفوفة تحتوي على رموز اللغات المدعومة. 
    | يمكنك تعديل هذه المصفوفة ديناميكياً من أي ServiceProvider في تطبيقك الرئيسي.
    */
    'supported_locales' => ['ar', 'en'],

    /*
    |--------------------------------------------------------------------------
    | Fallback Locale
    |--------------------------------------------------------------------------
    | اللغة الافتراضية في حال لم يتم التعرف على لغة المستخدم.
    */
    'fallback_locale' => env('APP_FALLBACK_LOCALE', 'ar'),

    /*
    |--------------------------------------------------------------------------
    | Detection Priorities
    |--------------------------------------------------------------------------
    | مفاتيح البحث لتحديد لغة المستخدم.
    */
    'detectors' => [
        'route_parameter' => 'locale',          // اسم المتغير في مسار الرابط (الـ Route)
        'header'          => 'Accept-Language', // اسم الهيدر 
        'session_key'     => 'locale',          // اسم المفتاح في الجلسة (Session)
    ]
];
